In [1]:
from env import user, password, hostname 
import pymysql
import pandas as pd
import numpy as np
np.random.seed(210)

1-2. Performed 

3.Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

In [2]:
def get_db_url (user, password, hostname, db_name):    
    return (f'mysql+pymysql://{user}:{password}@{hostname}/{db_name}')

4. Use your function to obtain a connection to the employees database.

In [3]:
url = get_db_url(user, password, hostname,'employees')

Once you have successfully run a query:

a. Intentionally make a typo in the database url. What kind of error message do you see?

b. Intentionally make an error in your SQL query. What does the error message look like?

In [4]:
#5
employees = pd.read_sql('SELECT * FROM employees LIMIT 5', url)
employees

#a. extra space in my syntax 
#b. gives error

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [5]:
employees.info()
#print(employees)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   emp_no      5 non-null      int64
 1   birth_date  5 non-null      object
 2   first_name  5 non-null      object
 3   last_name   5 non-null      object
 4   gender      5 non-null      object
 5   hire_date   5 non-null      object
dtypes: int64(1), object(5)
memory usage: 368.0+ bytes

6. Read the employees and titles tables into two separate DataFrames.

7. How many rows and columns do you have in each DataFrame? Is that what you expected?

In [ ]:
employees.shape

8. Display the summary statistics for each DataFrame.

In [ ]:
titles_df.describe()

9. How many unique titles are in the titles DataFrame?

In [ ]:
titles_df.unique()

10. What is the oldest date in the to_date column?

In [ ]:
titles_df 'to_data'].max

11. What is the most recent date in the to_date column?

In [ ]:
titles_df 'to_data'].min

## Exercises II

Copy the users and roles DataFrames from the examples above.

In [ ]:
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})

What is the result of using a right join on the DataFrames?

In [ ]:
users.merge(roles, left_on = 'role_id', right_on = 'id', how = 'right')

What is the result of using an outer join on the DataFrames?

In [ ]:
users.merge(roles, left_on = 'role_id', right_on = 'id', how = 'outer')

What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [ ]:
 users.drop('role_id', axis=1).merge(roles)

# Columns empty because there are unable to merge.

Load the mpg dataset from PyDataset.

In [ ]:
from pydataset import data
mpg = data('mpg')
mpg.head()

Output and read the documentation for the mpg dataset.

In [ ]:
data('mpg', show_doc=True)

How many rows and columns are in the dataset?

In [ ]:
mpg.shape

Check out your column names and perform any cleanup you may want on them.

In [ ]:
mpg.columns

Display the summary statistics for the dataset.

In [ ]:
mpg = mpg.rename(columns = {'displ':'display','fl':'fuel'})
mpg.head(2)

In [ ]:
mpg.describe()

How many different manufacturers are there?

In [ ]:
print(list(mpg.manufacturer.unique()))
len(mpg.manufacturer.unique())

How many different models are there?

In [ ]:
print(list(mpg.model.unique()))
len(mpg.model.unique())

Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

In [ ]:
mpg['mileage_difference'] = mpg['hwy'] - mpg['cty'] 
mpg.head()

Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

In [ ]:
mpg['average_mileage'] = (mpg['hwy'] + mpg['cty']) / 2
mpg.head()

Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [ ]:
mpg['is_automatic'] = mpg['trans'].str.find('auto') >= 0
mpg.head()

Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [ ]:
mpg.groupby('manufacturer').average_mileage \
                            .mean() \
                            .sort_values(ascending=False).head(1)

Do automatic or manual cars have better miles per gallon?

In [ ]:
mpg.groupby('is_automatic').average_mileage \
                            .mean()

## Exercises III

Use your get_db_url function to help you explore the data from the chipotle database.

In [11]:
chipotle_url = get_db_url(user, password, hostname,'chipotle')
sql = 'SELECT * FROM orders'
orders = pd.read_sql(sql, chipotle_url)
orders.head()

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

What is the total price for each order?

In [12]:
orders['total_item_price'] = orders['quantity'] * orders['item_price']
orders.head(5)

,id,order_id,quantity,item_name,choice_description,item_price,total_item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39,$2.39
1,2,1,1,Izze,[Clementine],$3.39,$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39,$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98,$16.98 $16.98

What are the most popular 3 items?

In [13]:
orders.groupby('item_name').quantity.sum().sort_values(ascending=False).head(3)

item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Name: quantity, dtype: int64

Which item has produced the most revenue?

In [14]:
orders.groupby('item_name').total_item_price.sum().sort_values(ascending=False).head(1)

item_name
Carnitas Soft Tacos    $9.25 $9.25 $9.25 $9.25 $9.25 $8.99 $8.99 $8.9...
Name: total_item_price, dtype: object

Join the employees and titles DataFrames together.

In [19]:
emp_url = get_db_url(user, password, hostname,'employees')
emp_sql = 'SELECT * FROM employees'
employees = pd.read_sql(emp_sql, emp_url)
employees.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [20]:
titles_sql = 'SELECT * FROM titles'
titles = pd.read_sql(titles_sql, emp_url)
titles.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

For each title, find the hire date of the employee that was hired most recently with that title.

In [21]:
emp_title_df = employees.merge(titles, how='inner',
                left_on='emp_no', right_on='emp_no')
emp_title_df.head()

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01

Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)

In [ ]:
emp_title_df.crosstab(emp_title_df, df.passing_math)